zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/same51j-pinctrl.h
/* pb7b_ptc_xy25 */
#define PB7B_PTC_XY25 \
	SAM_PINMUX(b, 7, b, periph)

/* pb7n_ccl_in7 */
#define PB7N_CCL_IN7 \
	SAM_PINMUX(b, 7, n, periph)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 \
	SAM_PINMUX(b, 8, a, periph)

/* pb8b_adc0_ain2 */
#define PB8B_ADC0_AIN2 \
	SAM_PINMUX(b, 8, b, periph)

/* pb8b_adc1_ain0 */
#define PB8B_ADC1_AIN0 \
	SAM_PINMUX(b, 8, b, periph)

/* pb8b_ptc_xy1 */
#define PB8B_PTC_XY1 \
	SAM_PINMUX(b, 8, b, periph)

/* pb8d_sercom4_pad0 */
#define PB8D_SERCOM4_PAD0 \
	SAM_PINMUX(b, 8, d, periph)

/* pb8e_tc4_wo0 */
#define PB8E_TC4_WO0 \
	SAM_PINMUX(b, 8, e, periph)

/* pb8n_ccl_in8 */
#define PB8N_CCL_IN8 \
	SAM_PINMUX(b, 8, n, periph)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 \
	SAM_PINMUX(b, 9, a, periph)

/* pb9b_adc0_ain3 */
#define PB9B_ADC0_AIN3 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9b_adc1_ain1 */
#define PB9B_ADC1_AIN1 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9b_ptc_xy2 */
#define PB9B_PTC_XY2 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9d_sercom4_pad1 */
#define PB9D_SERCOM4_PAD1 \
	SAM_PINMUX(b, 9, d, periph)

/* pb9e_tc4_wo1 */
#define PB9E_TC4_WO1 \
	SAM_PINMUX(b, 9, e, periph)

/* pb9n_ccl_out2 */
#define PB9N_CCL_OUT2 \
	SAM_PINMUX(b, 9, n, periph)

/* pb10_gpio */
#define PB10_GPIO \
	SAM_PINMUX(b, 10, gpio, gpio)

/* pb10a_eic_extint10 */
#define PB10A_EIC_EXTINT10 \
	SAM_PINMUX(b, 10, a, periph)

/* pb10d_sercom4_pad2 */
#define PB10D_SERCOM4_PAD2 \
	SAM_PINMUX(b, 10, d, periph)

/* pb10e_tc5_wo0 */
#define PB10E_TC5_WO0 \
	SAM_PINMUX(b, 10, e, periph)

/* pb10f_tcc0_wo4 */
#define PB10F_TCC0_WO4 \
	SAM_PINMUX(b, 10, f, periph)

/* pb10g_tcc1_wo0 */
#define PB10G_TCC1_WO0 \
	SAM_PINMUX(b, 10, g, periph)

/* pb10h_qspi_sck */
#define PB10H_QSPI_SCK \
	SAM_PINMUX(b, 10, h, periph)

/* pb10i_sdhc0_dat3 */
#define PB10I_SDHC0_DAT3 \
	SAM_PINMUX(b, 10, i, periph)

/* pb10j_iis_sdi */
#define PB10J_IIS_SDI \
	SAM_PINMUX(b, 10, j, periph)

/* pb10m_gclk_io4 */
#define PB10M_GCLK_IO4 \
	SAM_PINMUX(b, 10, m, periph)

/* pb10n_ccl_in11 */
#define PB10N_CCL_IN11 \
	SAM_PINMUX(b, 10, n, periph)

/* pb11_gpio */
#define PB11_GPIO \
	SAM_PINMUX(b, 11, gpio, gpio)

/* pb11a_eic_extint11 */
#define PB11A_EIC_EXTINT11 \
	SAM_PINMUX(b, 11, a, periph)

/* pb11d_sercom4_pad3 */
#define PB11D_SERCOM4_PAD3 \
	SAM_PINMUX(b, 11, d, periph)

/* pb11e_tc5_wo1 */
#define PB11E_TC5_WO1 \
	SAM_PINMUX(b, 11, e, periph)

/* pb11f_tcc0_wo5 */
#define PB11F_TCC0_WO5 \
	SAM_PINMUX(b, 11, f, periph)

/* pb11g_tcc1_wo1 */
#define PB11G_TCC1_WO1 \
	SAM_PINMUX(b, 11, g, periph)

/* pb11h_qspi_cs */
#define PB11H_QSPI_CS \
	SAM_PINMUX(b, 11, h, periph)

/* pb11i_sdhc0_ck */
#define PB11I_SDHC0_CK \
	SAM_PINMUX(b, 11, i, periph)

/* pb11j_iis_fs1 */
#define PB11J_IIS_FS1 \
	SAM_PINMUX(b, 11, j, periph)

/* pb11m_gclk_io5 */
#define PB11M_GCLK_IO5 \
	SAM_PINMUX(b, 11, m, periph)

/* pb11n_ccl_out1 */
#define PB11N_CCL_OUT1 \
	SAM_PINMUX(b, 11, n, periph)

/* pb12_gpio */
#define PB12_GPIO \
	SAM_PINMUX(b, 12, gpio, gpio)

/* pb12a_eic_extint12 */
#define PB12A_EIC_EXTINT12 \
	SAM_PINMUX(b, 12, a, periph)

/* pb12b_ptc_xy26 */
#define PB12B_PTC_XY26 \
	SAM_PINMUX(b, 12, b, periph)

/* pb12c_sercom4_pad0 */
#define PB12C_SERCOM4_PAD0 \
	SAM_PINMUX(b, 12, c, periph)

/* pb12e_tc4_wo0 */
#define PB12E_TC4_WO0 \
	SAM_PINMUX(b, 12, e, periph)

/* pb12f_tcc3_wo0 */
#define PB12F_TCC3_WO0 \
	SAM_PINMUX(b, 12, f, periph)

/* pb12g_tcc0_wo0 */
#define PB12G_TCC0_WO0 \
	SAM_PINMUX(b, 12, g, periph)

/* pb12h_can1_tx */
#define PB12H_CAN1_TX \
	SAM_PINMUX(b, 12, h, periph)

/* pb12i_sdhc0_cd */
#define PB12I_SDHC0_CD \
	SAM_PINMUX(b, 12, i, periph)

/* pb12j_iis_sck1 */
#define PB12J_IIS_SCK1 \
	SAM_PINMUX(b, 12, j, periph)

/* pb12m_gclk_io6 */
#define PB12M_GCLK_IO6 \
	SAM_PINMUX(b, 12, m, periph)

/* pb13_gpio */
#define PB13_GPIO \
	SAM_PINMUX(b, 13, gpio, gpio)

/* pb13a_eic_extint13 */
#define PB13A_EIC_EXTINT13 \
	SAM_PINMUX(b, 13, a, periph)

/* pb13b_ptc_xy27 */
#define PB13B_PTC_XY27 \
	SAM_PINMUX(b, 13, b, periph)

/* pb13c_sercom4_pad1 */
#define PB13C_SERCOM4_PAD1 \
	SAM_PINMUX(b, 13, c, periph)

/* pb13e_tc4_wo1 */
#define PB13E_TC4_WO1 \
	SAM_PINMUX(b, 13, e, periph)

/* pb13f_tcc3_wo1 */
#define PB13F_TCC3_WO1 \
	SAM_PINMUX(b, 13, f, periph)

/* pb13g_tcc0_wo1 */
#define PB13G_TCC0_WO1 \
	SAM_PINMUX(b, 13, g, periph)

/* pb13h_can1_rx */
#define PB13H_CAN1_RX \
	SAM_PINMUX(b, 13, h, periph)

/* pb13i_sdhc0_wp */
#define PB13I_SDHC0_WP \
	SAM_PINMUX(b, 13, i, periph)

/* pb13j_iis_mck1 */
#define PB13J_IIS_MCK1 \
	SAM_PINMUX(b, 13, j, periph)

/* pb13m_gclk_io7 */
#define PB13M_GCLK_IO7 \
	SAM_PINMUX(b, 13, m, periph)

/* pb14_gpio */
#define PB14_GPIO \
	SAM_PINMUX(b, 14, gpio, gpio)

/* pb14a_eic_extint14 */
#define PB14A_EIC_EXTINT14 \
	SAM_PINMUX(b, 14, a, periph)

/* pb14b_ptc_xy28 */
#define PB14B_PTC_XY28 \
	SAM_PINMUX(b, 14, b, periph)

/* pb14c_sercom4_pad2 */
#define PB14C_SERCOM4_PAD2 \
	SAM_PINMUX(b, 14, c, periph)

/* pb14e_tc5_wo0 */
#define PB14E_TC5_WO0 \
	SAM_PINMUX(b, 14, e, periph)

/* pb14f_tcc4_wo0 */
#define PB14F_TCC4_WO0 \
	SAM_PINMUX(b, 14, f, periph)

/* pb14g_tcc0_wo2 */
#define PB14G_TCC0_WO2 \
	SAM_PINMUX(b, 14, g, periph)

/* pb14h_can1_tx */
#define PB14H_CAN1_TX \
	SAM_PINMUX(b, 14, h, periph)

/* pb14k_pcc_data8 */
#define PB14K_PCC_DATA8 \
	SAM_PINMUX(b, 14, k, periph)

/* pb14m_gclk_io0 */
#define PB14M_GCLK_IO0 \
	SAM_PINMUX(b, 14, m, periph)

/* pb14n_ccl_in9 */
#define PB14N_CCL_IN9 \
	SAM_PINMUX(b, 14, n, periph)

/* pb15_gpio */
#define PB15_GPIO \
	SAM_PINMUX(b, 15, gpio, gpio)

/* pb15a_eic_extint15 */
#define PB15A_EIC_EXTINT15 \
	SAM_PINMUX(b, 15, a, periph)

/* pb15b_ptc_xy29 */
#define PB15B_PTC_XY29 \
	SAM_PINMUX(b, 15, b, periph)

/* pb15c_sercom4_pad3 */
#define PB15C_SERCOM4_PAD3 \
	SAM_PINMUX(b, 15, c, periph)

/* pb15e_tc5_wo1 */
#define PB15E_TC5_WO1 \
	SAM_PINMUX(b, 15, e, periph)

/* pb15f_tcc4_wo1 */
#define PB15F_TCC4_WO1 \
	SAM_PINMUX(b, 15, f, periph)

