zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/same51j-pinctrl.h
/* pb15g_tcc0_wo3 */
#define PB15G_TCC0_WO3 \
	SAM_PINMUX(b, 15, g, periph)

/* pb15h_can1_rx */
#define PB15H_CAN1_RX \
	SAM_PINMUX(b, 15, h, periph)

/* pb15k_pcc_data9 */
#define PB15K_PCC_DATA9 \
	SAM_PINMUX(b, 15, k, periph)

/* pb15m_gclk_io1 */
#define PB15M_GCLK_IO1 \
	SAM_PINMUX(b, 15, m, periph)

/* pb15n_ccl_in10 */
#define PB15N_CCL_IN10 \
	SAM_PINMUX(b, 15, n, periph)

/* pb16_gpio */
#define PB16_GPIO \
	SAM_PINMUX(b, 16, gpio, gpio)

/* pb16a_eic_extint0 */
#define PB16A_EIC_EXTINT0 \
	SAM_PINMUX(b, 16, a, periph)

/* pb16c_sercom5_pad0 */
#define PB16C_SERCOM5_PAD0 \
	SAM_PINMUX(b, 16, c, periph)

/* pb16e_tc6_wo0 */
#define PB16E_TC6_WO0 \
	SAM_PINMUX(b, 16, e, periph)

/* pb16f_tcc3_wo0 */
#define PB16F_TCC3_WO0 \
	SAM_PINMUX(b, 16, f, periph)

/* pb16g_tcc0_wo4 */
#define PB16G_TCC0_WO4 \
	SAM_PINMUX(b, 16, g, periph)

/* pb16i_sdhc1_cd */
#define PB16I_SDHC1_CD \
	SAM_PINMUX(b, 16, i, periph)

/* pb16j_iis_sck0 */
#define PB16J_IIS_SCK0 \
	SAM_PINMUX(b, 16, j, periph)

/* pb16m_gclk_io2 */
#define PB16M_GCLK_IO2 \
	SAM_PINMUX(b, 16, m, periph)

/* pb16n_ccl_in11 */
#define PB16N_CCL_IN11 \
	SAM_PINMUX(b, 16, n, periph)

/* pb17_gpio */
#define PB17_GPIO \
	SAM_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 \
	SAM_PINMUX(b, 17, a, periph)

/* pb17c_sercom5_pad1 */
#define PB17C_SERCOM5_PAD1 \
	SAM_PINMUX(b, 17, c, periph)

/* pb17e_tc6_wo1 */
#define PB17E_TC6_WO1 \
	SAM_PINMUX(b, 17, e, periph)

/* pb17f_tcc3_wo1 */
#define PB17F_TCC3_WO1 \
	SAM_PINMUX(b, 17, f, periph)

/* pb17g_tcc0_wo5 */
#define PB17G_TCC0_WO5 \
	SAM_PINMUX(b, 17, g, periph)

/* pb17i_sdhc1_wp */
#define PB17I_SDHC1_WP \
	SAM_PINMUX(b, 17, i, periph)

/* pb17j_iis_mck0 */
#define PB17J_IIS_MCK0 \
	SAM_PINMUX(b, 17, j, periph)

/* pb17m_gclk_io3 */
#define PB17M_GCLK_IO3 \
	SAM_PINMUX(b, 17, m, periph)

/* pb17n_ccl_out3 */
#define PB17N_CCL_OUT3 \
	SAM_PINMUX(b, 17, n, periph)

/* pb22_gpio */
#define PB22_GPIO \
	SAM_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 \
	SAM_PINMUX(b, 22, a, periph)

/* pb22c_sercom1_pad2 */
#define PB22C_SERCOM1_PAD2 \
	SAM_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 \
	SAM_PINMUX(b, 22, d, periph)

/* pb22e_tc7_wo0 */
#define PB22E_TC7_WO0 \
	SAM_PINMUX(b, 22, e, periph)

/* pb22g_pdec_qdi2 */
#define PB22G_PDEC_QDI2 \
	SAM_PINMUX(b, 22, g, periph)

/* pb22h_usb_sof */
#define PB22H_USB_SOF \
	SAM_PINMUX(b, 22, h, periph)

/* pb22m_gclk_io0 */
#define PB22M_GCLK_IO0 \
	SAM_PINMUX(b, 22, m, periph)

/* pb22n_ccl_in0 */
#define PB22N_CCL_IN0 \
	SAM_PINMUX(b, 22, n, periph)

/* pb23_gpio */
#define PB23_GPIO \
	SAM_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 \
	SAM_PINMUX(b, 23, a, periph)

/* pb23c_sercom1_pad3 */
#define PB23C_SERCOM1_PAD3 \
	SAM_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 \
	SAM_PINMUX(b, 23, d, periph)

/* pb23e_tc7_wo1 */
#define PB23E_TC7_WO1 \
	SAM_PINMUX(b, 23, e, periph)

/* pb23g_pdec_qdi0 */
#define PB23G_PDEC_QDI0 \
	SAM_PINMUX(b, 23, g, periph)

/* pb23m_gclk_io1 */
#define PB23M_GCLK_IO1 \
	SAM_PINMUX(b, 23, m, periph)

/* pb23n_ccl_out0 */
#define PB23N_CCL_OUT0 \
	SAM_PINMUX(b, 23, n, periph)

/* pb30_gpio */
#define PB30_GPIO \
	SAM_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 \
	SAM_PINMUX(b, 30, a, periph)

/* pb30d_sercom5_pad1 */
#define PB30D_SERCOM5_PAD1 \
	SAM_PINMUX(b, 30, d, periph)

/* pb30e_tc0_wo0 */
#define PB30E_TC0_WO0 \
	SAM_PINMUX(b, 30, e, periph)

/* pb30f_tcc4_wo0 */
#define PB30F_TCC4_WO0 \
	SAM_PINMUX(b, 30, f, periph)

/* pb30g_tcc0_wo6 */
#define PB30G_TCC0_WO6 \
	SAM_PINMUX(b, 30, g, periph)

/* pb30h_swd_swo */
#define PB30H_SWD_SWO \
	SAM_PINMUX(b, 30, h, periph)

/* pb31_gpio */
#define PB31_GPIO \
	SAM_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 \
	SAM_PINMUX(b, 31, a, periph)

/* pb31d_sercom5_pad0 */
#define PB31D_SERCOM5_PAD0 \
	SAM_PINMUX(b, 31, d, periph)

/* pb31e_tc0_wo1 */
#define PB31E_TC0_WO1 \
	SAM_PINMUX(b, 31, e, periph)

/* pb31f_tcc4_wo1 */
#define PB31F_TCC4_WO1 \
	SAM_PINMUX(b, 31, f, periph)

/* pb31g_tcc0_wo7 */
#define PB31G_TCC0_WO7 \
	SAM_PINMUX(b, 31, g, periph)
